АлогистикТест2/src/DataProcessors/алк_РМ_МастераДГ/алк_РМ_МастераДГ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_МастераДГ</name>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Количество</name>
      <comment>Это Объем</comment>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Персонал</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проблемы</name>
    <attributes>
      <name>Проблема</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/DataProcessors/алк_РМ_МастераДГ/Forms/ФормаДобавленияПакетов/Module.bsl
&НаКлиенте
Процедура Подобрать(Команда)
	
	ТекстПоиска = "ДГ-"+Прав(Год,2)+"-" + ФОРМАТ(НомерПоиска,"ЧЦ=6; ЧВН=; ЧГ=0");
	
	Номер = ПолучитьСерийныйНомер(ТекстПоиска);		
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Номер) Тогда		
		Сообщить("Пакет не найден!");	
		Возврат;
	КонецЕсли;  
	
	СерийныйНомер = Номер; 
	
	МассивВозврата = Новый Массив;
	
	МассивВозврата.Добавить(Новый структура("Номенклатура, Характеристика, Сертификат, СерийныйНомер, КоличествоШтук, Количество, Склад", 
		Номенклатура, 
		Характеристика, 
		"",
		СерийныйНомер,
		Вес, 
		Вес/1000,
	    Склад)); 
	
	НомерПоиска = "";
	
	ОповеститьОВыборе(МассивВозврата);  
	
	ЭтаФорма.ТекущийЭлемент = Элементы.НомерПоиска;
	
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСерийныйНомер(ТекстПоиска)	
	
	Результат = Справочники.СерийныеНомера.ПустаяСсылка();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СерийныеНомера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ТекстПоиска);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Результат; 
	
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Номенклатура") Тогда 		
		Номенклатура = Параметры.Номенклатура; 		
	КонецЕсли;
	
	Если Параметры.Свойство("Склад") Тогда 		
		Склад = Параметры.Склад; 		
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда 			
		Дата = Параметры.Дата;		
		Год = Формат(Дата, "ДФ=yyyy");	
	КонецЕсли;  
	
КонецПроцедуры
